Revit 2027 API
GlobalParameter.IsValidFormula Method
 Tests that the given expression is a valid as formula for this parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidFormula(
	string expression
)
Public Function IsValidFormula (
	expression As String
) As Boolean
public:
bool IsValidFormula(
	String^ expression
)
member IsValidFormula :
        expression : string -> bool
Parameters
expression String
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Use this method to test validity of a formula before assigning it to a global parameter when in doubt whether it is an acceptable expression or not.
See Also
Reference
GlobalParameter Class
Autodesk.Revit.DB Namespace